aaron-bond.better-comments
anseki.vscode-color
anthropic.claude-code
batisteo.vscode-django
bmewburn.vscode-intelephense-client
bradlc.vscode-tailwindcss
christian-kohler.npm-intellisense
christian-kohler.path-intellisense
cschlosser.doxdocgen
cweijan.dbclient-jdbc
cweijan.vscode-database-client2
davidanson.vscode-markdownlint
dbaeumer.vscode-eslint
donjayamanne.python-environment-manager
donjayamanne.python-extension-pack
dsznajder.es7-react-js-snippets
eamodio.gitlens
editorconfig.editorconfig
esbenp.prettier-vscode
formulahendry.auto-close-tag
formulahendry.auto-rename-tag
github.copilot
github.copilot-chat
github.vscode-github-actions
github.vscode-pull-request-github
grapecity.gc-excelviewer
gruntfuggly.todo-tree
hansuxdev.bootstrap5-snippets
humao.rest-client
jeff-hykin.better-cpp-syntax
jerryhong.autofilename
kevinrose.vsc-python-indent
kokororin.vscode-phpfmt
mechatroner.rainbow-csv
mhutchie.git-graph
mikestead.dotenv
ms-azuretools.vscode-containers
ms-azuretools.vscode-docker
ms-dotnettools.vscode-dotnet-runtime
ms-python.debugpy
ms-python.python
ms-python.vscode-pylance
ms-python.vscode-python-envs
ms-toolsai.jupyter
ms-toolsai.jupyter-keymap
ms-toolsai.jupyter-renderers
ms-toolsai.vscode-jupyter-cell-tags
ms-toolsai.vscode-jupyter-slideshow
ms-vscode.cmake-tools
ms-vscode.cpptools
ms-vscode.cpptools-extension-pack
ms-vscode.cpptools-themes
ms-vscode.hexeditor
ms-vscode.live-server
ms-vscode.makefile-tools
ms-vscode.powershell
ms-vscode-remote.remote-containers
ms-vscode.sublime-keybindings
ms-vscode.vs-keybindings
mtxr.sqltools
naumovs.color-highlight
njpwerner.autodocstring
oderwat.indent-rainbow
openai.chatgpt
pkief.material-icon-theme
rangav.vscode-thunder-client
redhat.vscode-xml
redhat.vscode-yaml
ritwickdey.liveserver
shd101wyy.markdown-preview-enhanced
snyk-security.snyk-vulnerability-scanner
sonarsource.sonarlint-vscode
streetsidesoftware.code-spell-checker
styled-components.vscode-styled-components
tamasfe.even-better-toml
tomoki1207.pdf
twxs.cmake
usernamehw.errorlens
vincaslt.highlight-matching-tag
vscjava.vscode-java-upgrade
vscode-icons-team.vscode-icons
vue.volar
wayou.vscode-todo-highlight
wholroyd.jinja
wix.vscode-import-cost
xabikos.javascriptsnippets
xdebug.php-debug
xdebug.php-pack
yzhang.markdown-all-in-one
zhuangtongfa.material-theme
zignd.html-css-class-completion
