adpyke.codesnap
alex-chen.gitee-code-settings-sync
anseki.vscode-color
anthropic.claude-code
batisteo.vscode-django
bmewburn.vscode-intelephense-client
bradlc.vscode-tailwindcss
christian-kohler.npm-intellisense
christian-kohler.path-intellisense
circlecodesolution.ccs-flutter-color
codeium.codeium
cschlosser.doxdocgen
cweijan.dbclient-jdbc
cweijan.vscode-database-client2
dart-code.dart-code
dart-code.flutter
davidanson.vscode-markdownlint
dbaeumer.vscode-eslint
devsense.intelli-php-vscode
donjayamanne.jquerysnippets
donjayamanne.python-environment-manager
donjayamanne.python-extension-pack
dsznajder.es7-react-js-snippets
eamodio.gitlens
editorconfig.editorconfig
esbenp.prettier-vscode
firefox-devtools.vscode-firefox-debug
formulahendry.auto-close-tag
formulahendry.auto-rename-tag
gaborv.flatbuffers
github.copilot
github.copilot-chat
github.vscode-github-actions
github.vscode-pull-request-github
grapecity.gc-excelviewer
gruntfuggly.todo-tree
hansuxdev.bootstrap5-snippets
humao.rest-client
humy2833.ftp-simple
jebbs.plantuml
jeff-hykin.better-cpp-syntax
jerryhong.autofilename
jinsihou.diff-tool
kevinrose.vsc-python-indent
kokororin.vscode-phpfmt
local-smart.excel-live-server
lukasz-wronski.ftp-sync
mcright.auto-save
mechatroner.rainbow-csv
mhutchie.git-graph
microprofile-community.mp-rest-client-generator-vscode-ext
microprofile-community.mp-starter-vscode-ext
microprofile-community.vscode-microprofile-pack
mikestead.dotenv
ms-azuretools.vscode-containers
ms-azuretools.vscode-docker
ms-dotnettools.vscode-dotnet-modernize
ms-dotnettools.vscode-dotnet-runtime
ms-edgedevtools.vscode-edge-devtools
ms-kubernetes-tools.vscode-kubernetes-tools
ms-mssql.data-workspace-vscode
ms-mssql.mssql
ms-mssql.sql-bindings-vscode
ms-mssql.sql-database-projects-vscode
ms-python.debugpy
ms-python.python
ms-python.vscode-pylance
ms-python.vscode-python-envs
ms-toolsai.jupyter
ms-toolsai.jupyter-keymap
ms-toolsai.jupyter-renderers
ms-toolsai.vscode-jupyter-cell-tags
ms-toolsai.vscode-jupyter-slideshow
ms-vscode-remote.remote-containers
ms-vscode.cmake-tools
ms-vscode.cpp-devtools
ms-vscode.cpptools
ms-vscode.cpptools-extension-pack
ms-vscode.cpptools-themes
ms-vscode.hexeditor
ms-vscode.live-server
ms-vscode.makefile-tools
ms-vscode.powershell
ms-vscode.sublime-keybindings
ms-vscode.vs-keybindings
mtxr.sqltools
naumovs.color-highlight
njpwerner.autodocstring
octref.vetur
oderwat.indent-rainbow
open-liberty.liberty-dev-vscode-ext
openai.chatgpt
parallelsdesktop.parallels-desktop
payara.payara-vscode
pkief.material-icon-theme
qiqigou.tpl-lang
rangav.vscode-thunder-client
redhat.java
redhat.vscode-microprofile
redhat.vscode-quarkus
redhat.vscode-xml
redhat.vscode-yaml
ritwickdey.liveserver
salbert.copy-text
shd101wyy.markdown-preview-enhanced
shengchen.vscode-checkstyle
snyk-security.snyk-vulnerability-scanner
sonarsource.sonarlint-vscode
steoates.autoimport
streetsidesoftware.code-spell-checker
styled-components.vscode-styled-components
tamasfe.even-better-toml
thekalinga.bootstrap4-vscode
tomoki1207.pdf
twxs.cmake
usernamehw.errorlens
vincaslt.highlight-matching-tag
visualstudioexptteam.intellicode-api-usage-examples
vmware.vscode-boot-dev-pack
vmware.vscode-concourse
vmware.vscode-manifest-yaml
vmware.vscode-spring-boot
vscjava.vscode-gradle
vscjava.vscode-java-debug
vscjava.vscode-java-dependency
vscjava.vscode-java-pack
vscjava.vscode-java-test
vscjava.vscode-java-upgrade
vscjava.vscode-maven
vscjava.vscode-spring-boot-dashboard
vscjava.vscode-spring-initializr
vscode-icons-team.vscode-icons
vscodevim.vim
vue.volar
wayou.vscode-todo-highlight
wcwhitehead.bootstrap-3-snippets
wholroyd.jinja
will-stone.plastic
wix.vscode-import-cost
xabikos.javascriptsnippets
xdebug.php-debug
xdebug.php-pack
yandeu.five-server
yzhang.markdown-all-in-one
zhuangtongfa.material-theme
zignd.html-css-class-completion
zobo.php-intellisense
